/** @type {import('tailwindcss').Config} */
export default {
  content: ["./index.html", "./src/**/*.{js,ts,jsx,tsx}"],
  theme: {
    extend: {
      colors: {
        primary: {
          50: "#f8f9fa",
          100: "#f1f3f5",
          200: "#e9ecef",
          300: "#dee2e6",
          400: "#ced4da",
          500: "#adb5bd",
          600: "#868e96",
          700: "#495057",
          800: "#343a40", // لونك الأساسي
          900: "#212529",
        },
        secondary: {
          50: "#f9f9fb",
          100: "#f1f3f5",
          200: "#e4e6eb",
          300: "#d1d5db",
          400: "#9ca3af",
          500: "#6b7280",
          600: "#4b5563",
          700: "#374151",
          800: "#1f2937",
          900: "#111827",
        },
        third: {
          50: "#e6faff",
          100: "#b3f0fa",
          200: "#80e1f5",
          300: "#4dd1ef",
          400: "#26c2e6",
          500: "#1098ad", // الأساسي
          600: "#0d7a8a",
          700: "#095c66",
          800: "#053d44",
          900: "#021f22",
        },
        fourth: {
          50: "#e6f7fb",
          100: "#b3e5f5",
          200: "#80d2ef",
          300: "#4dbfe6",
          400: "#26acd9",
          500: "#1183ad", // الأساسي
          600: "#0d678a",
          700: "#094b66",
          800: "#053044",
          900: "#021622",
        },
        fifth: {
          50: "#f2f4f5",
          100: "#e6e9eb",
          200: "#cfd3d6",
          300: "#b8bcc1",
          400: "#92989e",
          500: "#6c757d",
          600: "#5c636a",
          700: "#495057", // الأساسي
          800: "#343a40",
          900: "#212529",
        },
      },
      fontFamily: {
        nunito: ["Nunito", "sans-serif"],
        poppins: ["Poppins", "sans-serif"],
      },
    },
  },
  plugins: [],
};
